<a href="https://colab.research.google.com/github/pravallika00/Adv-Prog/blob/master/(06_06_2020)Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
df1 = pd.read_csv("https://raw.githubusercontent.com/kotagiri-preeti/Summer-Internship-AI-and-ML/master/german_credit_data.csv")
df1

     Unnamed: 0  Age     Sex  ...  Credit amount Duration              Purpose
0             0   67    male  ...           1169        6             radio/TV
1             1   22  female  ...           5951       48             radio/TV
2             2   49    male  ...           2096       12            education
3             3   45    male  ...           7882       42  furniture/equipment
4             4   53    male  ...           4870       24                  car
..          ...  ...     ...  ...            ...      ...                  ...
995         995   31  female  ...           1736       12  furniture/equipment
996         996   40    male  ...           3857       30                  car
997         997   38    male  ...            804       12             radio/TV
998         998   23    male  ...           1845       45             radio/TV
999         999   27    male  ...           4576       45                  car

[1000 rows x 10 columns]

#If you find Unnamed column in the data remove that by filtering

In [0]:
df1 = pd.read_csv("https://raw.githubusercontent.com/kotagiri-preeti/Summer-Internship-AI-and-ML/master/german_credit_data.csv",index_col=0)
df1

     Age     Sex  Job  ... Credit amount Duration              Purpose
0     67    male    2  ...          1169        6             radio/TV
1     22  female    2  ...          5951       48             radio/TV
2     49    male    1  ...          2096       12            education
3     45    male    2  ...          7882       42  furniture/equipment
4     53    male    2  ...          4870       24                  car
..   ...     ...  ...  ...           ...      ...                  ...
995   31  female    1  ...          1736       12  furniture/equipment
996   40    male    3  ...          3857       30                  car
997   38    male    2  ...           804       12             radio/TV
998   23    male    2  ...          1845       45             radio/TV
999   27    male    2  ...          4576       45                  car

[1000 rows x 9 columns]

#Display the top seven rows and last Three rows

In [0]:
df = df1.head(7)
print(df)
df2 = df1.tail(3)
print(df2)

   Age     Sex  Job  ... Credit amount Duration              Purpose
0   67    male    2  ...          1169        6             radio/TV
1   22  female    2  ...          5951       48             radio/TV
2   49    male    1  ...          2096       12            education
3   45    male    2  ...          7882       42  furniture/equipment
4   53    male    2  ...          4870       24                  car
5   35    male    1  ...          9055       36            education
6   53    male    2  ...          2835       24  furniture/equipment

[7 rows x 9 columns]
     Age   Sex  Job Housing  ... Checking account Credit amount  Duration   Purpose
997   38  male    2     own  ...              NaN           804        12  radio/TV
998   23  male    2    free  ...           little          1845        45  radio/TV
999   27  male    2     own  ...         moderate          4576        45       car

[3 rows x 9 columns]

#Check the total number of entries you have

In [0]:
len(df1)

1000

#Check the No of features,Print features Names(Column Names)

In [0]:
print("Feature names:")
print(df1.columns)
print("No. of features:")
len(df1.columns)

Feature names:
Index(['Age', 'Sex', 'Job', 'Housing', 'Saving accounts', 'Checking account',
       'Credit amount', 'Duration', 'Purpose'],
      dtype='object')
No. of features:

9




#Print the row indices of the dataframe

In [0]:
data_top = df1.head()  
for row in data_top.index: 
    print(row, end = " ")

0 1 2 3 4

#Check the dtype of each and every columns

In [0]:
df1.dtypes

Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

#Description for Numerical Column min,max,count,25%,50%,75%,std

In [0]:
df1.describe()

               Age          Job  Credit amount     Duration
count  1000.000000  1000.000000    1000.000000  1000.000000
mean     35.546000     1.904000    3271.258000    20.903000
std      11.375469     0.653614    2822.736876    12.058814
min      19.000000     0.000000     250.000000     4.000000
25%      27.000000     2.000000    1365.500000    12.000000
50%      33.000000     2.000000    2319.500000    18.000000
75%      42.000000     2.000000    3972.250000    24.000000
max      75.000000     3.000000   18424.000000    72.000000

#Description for the categorical Columns count,top,freq

In [0]:
import numpy as np
df1.describe(exclude=[np.number])

         Sex Housing Saving accounts Checking account Purpose
count   1000    1000             817              606    1000
unique     2       3               4                3       8
top     male     own          little           little     car
freq     690     713             603              274     337

#Missing value count column wise

In [0]:
df1.isnull().sum()

Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

#Check the output for the info function

In [0]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Age               1000 non-null   int64
 1   Sex               1000 non-null   object
 2   Job               1000 non-null   int64
 3   Housing           1000 non-null   object
 4   Saving accounts   817 non-null    object
 5   Checking account  606 non-null    object
 6   Credit amount     1000 non-null   int64
 7   Duration          1000 non-null   int64
 8   Purpose           1000 non-null   object
dtypes: int64(4), object(5)
memory usage: 78.1+ KB

#Access particular rows and columns using iloc,loc

In [0]:
df1.iloc[0:5] # first five rows of dataframe
df1.iloc[:, 0:2] # first two columns of data frame with all rows
df1.iloc[[0,3,6,24], [0,5,6]] # 1st, 4th, 7th, 25th row + 1st 6th 7th columns.
df1.iloc[0:5, 5:8] # first 5 rows and 5th, 6th, 7th columns of data frame (county -> phone1).

  Checking account  Credit amount  Duration
0           little           1169         6
1         moderate           5951        48
2              NaN           2096        12
3           little           7882        42
4           little           4870        24

In [0]:
df1.loc[ [0,4] ,['Age', 'Job'] ]

   Age  Job
0   67    2
4   53    2

#How many unique values are there in a particular column

In [0]:
df1.Age.unique()

array([67, 22, 49, 45, 53, 35, 61, 28, 25, 24, 60, 32, 44, 31, 48, 26, 36,
       39, 42, 34, 63, 27, 30, 57, 33, 37, 58, 23, 29, 52, 50, 46, 51, 41,
       40, 66, 47, 56, 54, 20, 21, 38, 70, 65, 74, 68, 43, 55, 64, 75, 19,
       62, 59])